{
    "title": "TaxoCom: Topic Taxonomy Completion with Hierarchical Discovery of Novel Topic Clusters",
    "abstract": "Topic taxonomies, which represent the latent topic (or category) structure of document collections, provide valuable knowledge of contents in many applications such as web search and information filtering. Recently, several unsupervised methods have been developed to automatically construct the topic taxonomy from a text corpus, but it is challenging to generate the desired taxonomy without any prior knowledge. In this paper, we study how to leverage the partial (or incomplete) information about the topic structure as guidance to find out the complete topic taxonomy. We propose a novel framework for topic taxonomy completion, named TaxoCom, which recursively expands the topic taxonomy by discovering novel sub-topic clusters of terms and documents. To effectively identify novel topics within a hierarchical topic structure, TaxoCom devises its embedding and clustering techniques to be closely-linked with each other: (i) locally discriminative embedding optimizes the text embedding space to be discriminative among known (i.e., given) sub-topics, and (ii) novelty adaptive clustering assigns terms into either one of the known sub-topics or novel sub-topics. Our comprehensive experiments on two real-world datasets demonstrate that TaxoCom not only generates the high-quality topic taxonomy in terms of term coherency and topic coverage but also outperforms all other baselines for a downstream task.",
    "introduction": "Finding the latent topic structure of an input text corpus, also known as hierarchical topic discovery [ 7, 18 , 33 , 42 , 47 ], has been one of the most important problems for information extraction and semantic analysis of text data. Recently, several studies have focused on topic taxonomy construction [ 33, 47], which aims to generate a tree-structured taxonomy whose node corresponds to a conceptual topic; each node of the topic taxonomy is defined as a cluster of semantically coherent terms representing a single topic. Compared to a conventional entity (or term-level) taxonomy, this cluster-level taxonomy is more appropriate for representing the topic hierarchy of the target corpus with high coverage and low redundancy. To identify hierarchical topic clusters of terms, they mainly performed clustering on a low-dimensional text embedding space where textual semantic information is effectively encoded. However, their output topic taxonomy seems plausible by itself but often fails to match with the complete taxonomy designed by a human curator, because they rely on only the text corpus in an unsupervised manner. To be specific, their quality (e.g., coverage and accuracy) highly depends on the number of sub-topic clusters (i.e., child nodes), which has to be manually controlled by a user. In addition, it is sensitive to the topic imbalance in the document collection, which makes it difficult to find out minor topics. In the absence of any information about the topic hierarchy, the unsupervised methods intrinsically become vulnerable to these problems. On the other hand, for some other text mining tasks or NLP applications, several recent studies have tried to take advantage of auxiliary information about the latent topic structure [ 13, 21, 23 – 26 , 34 ]. Most of them focus on utilizing a hierarchy of topic surface names as additional supervision, because it can be easily given as a user's interests or prior knowledge. Specifically, they retrieve the top-𝐾 relevant terms to each topic [ 21 , 26 ] or train a hierarchical text classifier using unlabeled documents and the topic names [ 24 , 34 ]. Despite their effectiveness, their major limitation is that they are only able to consider the known topics included in the given topic hierarchy. That is, the coverage of the obtained results is strictly limited to the given topics. Since it is very challenging for a user to be aware of a full topic structure, a naive solution to incorporate a user-provided hierarchy of topic names into the topic taxonomy is likely to only partially cover the text corpus. To tackle this limitation, we introduce a new problem setting, named topic taxonomy completion, to construct a complete topic taxonomy by making use of additional topic information assumed to be partial or incomplete. Formally, given a text corpus and its partial hierarchy of topic names, this task aims to identify the term clusters for each topic, while discovering the novel topics that do not exist in the given hierarchy but exist in the corpus. Figure 1 illustrates a toy example of our task, where the novel topics (e.g, arts and hockey) are correctly detected and placed in the right position within the taxonomy. This task can be practically applied not only for the case that a user's incomplete knowledge is available, but also for incremental management of the topic taxonomy. In case that the document collection is constantly growing, and so are their topics, the out-dated topic taxonomy of the previous snapshot can serve as the partial hierarchy to capture emerging topics. The technical challenges of this task can be summarized as follows. First, novel topics should be identified by considering the hierarchical semantic relationship among the topics. In Figure 1, the topic hockey is not novel in terms of the root node, because it obviously belongs to its known sub-topic sports. However, hockey should be detected as a novel sub-topic of sports as it does not belong to any of the known sport sub-categories (i.e., soccer and baseball). Second, the granularity of novel sub-topics and that of known sub-topics need to be kept similar with each other, to achieve the consistency of semantic specificity among sibling nodes. In Figure 1, the root node should insert a single novel sub-topic arts, rather than two novel sub-topics music and dance, based on the semantic specificity of its known sub-topics (i.e., politics and sports). In this work, we propose TaxoCom, a hierarchical topic discovery framework to complete the topic taxonomy by recursively identifying novel sub-topic clusters of terms. For each topic node, TaxoCom performs (i) text embedding and (ii) text clustering, to assign the terms into one of either the existing child nodes (i.e., known sub-topics) or newly-created child nodes (i.e., novel subtopics). It first optimizes locally discriminative embedding which enforces the discrimination among the known sub-topics [ 21 , 26 ] by using the given topic surface names; this helps to make a clear distinction between known and novel sub-topic clusters as well. Then, it performs novelty adaptive clustering which separately finds the clusters on novel-topic terms and known-topic terms, respectively. In particular, TaxoCom selectively assigns the terms into the child nodes, referred to as anchor terms, while filtering out general terms based on their semantic relevance and representativeness. Extensive experiments on real-world datasets demonstrate that TaxoCom successfully completes a topic taxonomy with missing (i.e., novel) topic nodes correctly inserted. Our human evaluation quantitatively validates the superiority of topic taxonomies generated by TaxoCom, in terms of the topic coverage as well as semantic coherence among the topic terms. Furthermore, TaxoCom achieves the best performance among all baseline methods for a downstream task, which trains a weakly supervised text classifier by using the topic taxonomy instead of document-level labels.",
    "arxiv_key": "2201_06771"
}