{
    "title": "Unsupervised Key Event Detection from Massive Text Corpora",
    "abstract": "Automated event detection from news corpora is a crucial task towards mining fast-evolving structured knowledge. As real-world events have different granularities, from the top-level themes to key events and then to event mentions corresponding to concrete actions, there are generally two lines of research: (1) theme detection tries to identify from a news corpus major themes (e.g., “2019 Hong Kong Protests” versus “2020 U.S. Presidential Election”) which have very distinct semantics; and (2) action extraction aims to extract from a single document mention-level actions (e.g., “the police hit the left arm of the protester”) that are often too fine-grained for comprehending the real-world event. In this paper, we propose a new task, key event detection at the intermediate level, which aims to detect from a news corpus key events (e.g., HK Airport Protest on Aug. 12-14), each happening at a particular time/location and focusing on the same topic. This task can bridge event understanding and structuring and is inherently challenging because of (1) the thematic and temporal closeness of different key events and (2) the scarcity of labeled data due to the fast-evolving nature of news articles. To address these challenges, we develop an unsupervised key event detection framework, EvMine, that (1) extracts temporally frequent peak phrases using a novel ttf-itf score, (2) merges peak phrases into event-indicative feature sets by detecting communities from our designed peak phrase graph that captures document cooccurrences, semantic similarities, and temporal closeness signals, and (3) iteratively retrieves documents related to each key event by training a classifier with automatically generated pseudo labels from the event-indicative feature sets and refining the detected key events using the retrieved documents in each iteration. Extensive experiments and case studies show EvMine all the baseline methods and its ablations on two real-world news corpora.",
    "introduction": "Automated real-world event discovery has long been studied to help people quickly digest explosive information. Researchers studying human memory find people tend to organize real-world events in a hierarchical way [7, 36 ], ranging from top-level themes (e.g., “2019 Hong Kong (HK) Protests”) to middle level key events (e.g., July 1 Storming Legislative Building), possibly to sub-middle level episodes (e.g., “Protester besieged the legislature”), and down to bottom level actions1 (e.g., “Riot police squirt pepper spray at protesters”). As shown in Figure 2, going up this event structure hierarchy leads to larger and more coarse-grained “events” whereas moving down the hierarchy brings in more fine-grained and concrete mentions of \"events\". The broad spectrum of \"events\", differing in duration and complexity, has fostered a variety of event discovery studies under different task names. One line of research, named Topic Detection and Tracking (TDT) [ 1, 3 , 37 ], aims to detect themes from an input corpus where each theme is represented by a cluster of documents, focusing on distinct thematic topics. For example, documents about “2019 Hong Kong Protests” are thematically very distinct from those of “2020 U.S. Presidential Election”. As a result, content-based document clustering methods [2, 30] can easily separate those themes. However, these methods cannot effectively distinguish the key events of the same/similar themes (e.g., identify documents about HK Legislative Building Storming and HK Airport Sit-In from a corpus related to “2019 HK protests”) [12 ]. Another line of work [ 8 , 10 , 23 , 34 ] is action extraction which tries to extract concrete actions (represented as text spans) from input documents. For example, one action extracted from the sentence in Figure 2 can be “Riot police squirt pepper spray at protesters”. These methods typically require a predefined event schema along with massive human-labeled documents for model learning. Besides, their output event mentions are highly redundant as one real-world event can usually be expressed in different ways in multiple documents, which further prevents humans from seeing the overall picture of the event. In this paper, we propose a new task, key event detection, which aims to detect key events from a corpus about one general event theme, or theme corpus. We assume each document has a publication date in the corpus, and each key event, as an aggregation of actions with concrete event time and focused location, is usually covered by a collection of documents. Since previous studies work on either too coarse or too fine-grained views of events, key event discovery, sitting in the intermediate level, plays an essential role in bridging the real-world event understanding and structuring. As shown in Figure 1, given a theme corpus about “2019 Hong Kong Protests”, we extract key events such as July 1st Storming Legislative Building and Aug. 12-14 Hong Kong International Airport Protest2, which helps people gain insights about the theme and thus compensates the previous TDT studies. Meanwhile, first detecting key events provides subsequent action extraction models with extra clues on what type of actions will most likely appear in each document. Furthermore, the identified key events can directly benefit many downstream tasks like timeline generation [ 13 ], evolutionary analysis [38], and query expansion [26]. Our proposed key event discovery task, while being useful, has its own challenges. First, compared to previous topic detection and tracking task, our task is intrinsically harder because it aims to distinguish key events of the same theme and those key events are often thematically similar and temporally closer to each other. Besides, as new events are happening every day, it is neither realistic nor scalable to curate all event schema in advance or label documents for training supervised event extraction models. To address the above challenges, we propose an unsupervised key event detection framework, EvMine, that requires no humanlabeled training data and can automatically discover key events from a large theme corpus. EvMine contains three major steps. First, we extract event-related “peak phrases” from input corpus based on 2All key events in this paper are manually named for easy understanding. our proposed “temporal term frequency–inverse time frequency” (ttf-itf) measure, where each peak phrase is unusually frequent on a day and thus likely indicates a key event. Second, as some key events can span multiple consecutive days and people have various ways to communicate the same key event, we group detected peak phrases into semantic clusters, which will serve as event-indicative features for selecting key event documents. Specifically, we propose a novel topic-time integrated peak phrase graph that considers document co-occurrence features, pre-trained masked language model (MLM) based semantic similarities, and temporal closeness, based on which we cluster peak phrases with a community detection algorithm. Each peak phrase cluster corresponds to one key event and provides event-indicative features. Finally, for each key event, we use the phrases in its corresponding peak phrase cluster to train a classifier that predicts whether a document is related to this key event. We also introduce a feedback loop that uses the current classification results to improve the phrase-based pseudo labels and find possibly missing key events, leading to an iterative document selection process with automatic refinement in each iteration. To summarize, our contributions are: (1) We introduce a new research problem key event detection, which takes a set of documents related to the same theme as inputs and outputs multiple important key events along with their associated documents. (2) We propose EvMine, a novel unsupervised framework for key event detection. EvMine automatically extracts temporally frequent peak phrases, clusters them with a graph-based method that combines thematic and temporal information, and applies document classification with iterative refinements to retrieve the most relevant documents for each key event. (3) We conduct quantitative evaluation, case studies, and parameter sensitivity analysis on two real-world event theme corpora, and EvMine outperforms all the baseline methods and its own ablations in terms of the ability to detect key events",
    "arxiv_key": "2206_04153"
}