{
    "title": "Unsupervised Episode Detection for Large-Scale News Events",
    "abstract": "Episodic structures are inherently interpretable and adaptable to evolving large-scale key events. However, state-of-the-art automatic event detection methods overlook event episodes and, therefore, struggle with these crucial characteristics. This paper introduces a novel task, episode detection, aimed at identifying episodes from a news corpus containing key event articles. An episode describes a cohesive cluster of core entities (e.g., “protesters”, “police”) performing actions at a specific time and location. Furthermore, an episode is a significant part of a larger group of episodes under a particular key event. Automatically detecting episodes is challenging because, unlike key events and atomic actions, we cannot rely on explicit mentions of times and locations to distinguish between episodes or use semantic similarity to merge inconsistent episode co-references. To address these challenges, we introduce EpiMine, an unsupervised episode detection framework that (1) automatically identifies the most salient, key-event-relevant terms and segments, (2) determines candidate episodes in an article based on natural episodic partitions estimated through shifts in discriminative term combinations, and (3) refines and forms final episode clusters using large language model-based reasoning on the candidate episodes. We construct three diverse, real-world event datasets annotated at the episode level. EpiMine outperforms all baselines on these datasets by an average 59.2% increase across all metrics.",
    "introduction": "Given the saturation of real-time news accessible at our fingertips, reading and processing the critical information of a key event has become an increasingly daunting challenge. Consequently, research on automatic textual event detection has recently attempted to integrate the manner in which humans neurologically perceive/store events into textual event detection methods. Specifically, neuroscientists studying event representations in human memory find that events are stored in a top-to-bottom hierarchy, as demonstrated in Figure 1. The deeper the hierarchical event level, the more finegrained its corresponding text granularity [ 48 ]: we consider a theme as corpus-level (all articles discussing the 2019 Hong Kong Protests), key event as document-level (an article typically discusses a full one to two day key event), episode as segment-level, and atomic action as sentence or phrase-level. Furthermore, neurological research [3 , 21 ] indicates that events are encoded into memory as episodic structures. Representing events as discrete episodes helps us piece together a coherent narrative by considering the sequence of actions, reactions, and developments over time. This empowers several downstream tasks (e.g., event schema generation, event prediction), which may benefit from insights into the causes and consequences of events that might be missed with a more generalized analysis. Despite its strengths, existing automatic event extraction works fail to consider the episode-level. For example, key event detection specifically seeks to output “a set of thematically coherent documents” for each key event [ 29, 48]. However, it is challenging to manually parse through a large cluster of relevant articles in order to gain an efficient and compact understanding of a given event. To address the lack of interpretability of such article clusters, the adjacent task of timeline summarization [9 , 14 , 23, 39 ] aims to identify the dates and a compact summary for each key event. However, high-level timelines are typically applicable for historical themes and thus unrealistic for currently evolving key events where fine-grained timeline summarization is more suitable. Hence, event chain mining [ 18] attempts to address this by mining a series of temporally-ordered atomic actions at the phraselevel; however, the granularity level is often too fine-grained to properly represent a large-scale key event. Thus, we aim to tackle the novel task of episode detection to pave the way for a more effective event representation. Episode detection aims to detect episodes from a news corpus containing key event articles. An episode can be described as a cohesive cluster of subjects performing actions at a certain time and location, occurring as part of a larger sequence of episodes under a specific key event. Episode detection introduces a unique set of challenges, which we address using our novel framework, EpiMine. EpiMine is an unsupervised episode detection framework that automatically detects meaningful episodic events and their corresponding text segments in a large key event corpus, all without any level of human supervision or labeled training data. EpiMine is comprised of the following components: (1) discriminative co-occurrence detection, (2) episode partitioning, (3) candidate episode estimation, and (4) episode-segment classification. Collectively, they tackle the unique challenges of episode detection, detailed below: Challenge 1: Journalists do not timestamp episodes. Key event detection partitions a thematic corpus into document-level clusters by heavily relying on explicit temporal features, like publication dates [48 ]. For example, an article primarily discusses one key event, which can then be roughly mapped to the article's publication date. However, this assumption fails at the episode-level, where there is no guarantee to have a distinct timestamp associated with each text segment that discusses a new episode. Fortunately, we can take advantage of the idea that journalists naturally partition news articles by sequentially discussing distinct episodes: Example: An article likely completes its discussion of the episode A, protesters storming the Legislaive Council, before episode B, “protesters vandalized the Legislative Chamber” (Figure 3). Hence, in order to partition articles into distinct episode segments, EpiMine must identify whether or not two consecutive segments are discussing the same or different episodes, which brings us to our next challenge. Challenge 2: Episodes contain semantically diverse actions. Each episode features a set of unique atomic actions, which we can utilize for determining whether or not two segments discuss the same episode. However, for clustering actions, existing methods [18 ] rely heavily on semantic similarity. This not realistic for episode-segment clustering: Example: “protesters spray-painted slogans” and “they unfurled the colonial-era flag” will fall under the same episode, but are semantically different and unlikely to be clustered. Alternatively, we can identify salient terms that reflect the same episode (“barriers” and “shoved” are unique to Episode A; “defaced” and “walls” for Episode B), by exploiting corpus-level signals. Specifically, if we frequently see “defaced” mentioned together with “walls” (or their respective synonyms) and not with other terms (and vice-versa), then we consider them a discriminative co-occurrence. Consequently, when such co-occurrences remain consistent across text segments, this indicates the same episode being discussed. Conversely, if a sufficient shift in the combination of terms occurs, then this indicates that a different episode is being discussed. Challenge 3: Articles often do not feature all episodes. Given the real-time nature of reporting, an article may feature only a subset or none of ground-truth episodes from a multi-day key event (e.g., focusing on a high-level analysis of the key event or mentioning other related key events). To minimize this noise, EpiMine seeks to identify the set of articles which maximizes the quantity and quality of potential episodes. It then merges any article partitions across these articles which likely discuss the same episode and employs a large language model (LLM) to provide a more fluent interpretation of the candidate episodes, accounting for the episode's core entity, actions, object, location, and time period. This allows EpiMine to finally map the remaining non-salient article segments to these episodes, pruning any candidates which are not sufficiently supported by the remaining articles. We summarize our core contributions: (1) We introduce the novel task of episode detection, which takes in a key-event corpus and outputs multiple detected episodes and their related segments extracted from the corpus. (2) We propose a novel unsupervised episode detection method, EpiMine, which exploits discriminative term co-occurrences to estimate candidate episode partitions from top articles. It refines these candidate episodes using LLM-based reasoning to output a comprehensive and diverse set of episodes. (3) We construct three novel datasets, reflecting a diverse set of real-world themes and thirty global key events, as no large-scale key event-specific news corpus exists for this task where the key events are guaranteed to contain distinguishable episodes. (4) We compare EpiMine with five other baselines through an extensive set of experiments and case studies performed on our real-world datasets, demonstrating that it outperforms all baselines by, on average, a 59.2% increase across all metrics. Reproducibility: We provide our dataset and source code1 to facilitate further studies.",
    "arxiv_key": "2408_04873"
}