{
    "title": "MILO : Model-Agnostic Subset Selection Framework for Efficient Model Training and Tuning",
    "abstract": "Training deep networks and tuning hyperparameters on large datasets is computationally intensive. One of the primary research directions for efficient training is to reduce training costs by selecting well-generalizable subsets of training data. Compared to simple adaptive random subset selection baselines, existing intelligent subset selection approaches are not competitive due to the time-consuming subset selection step, which involves computing model-dependent gradients and feature embeddings and applies greedy maximization of submodular objectives. Our key insight is that removing the reliance on downstream model parameters enables subset selection as a pre-processing step and enables one to train multiple models at no additional cost. In this work, we propose MILO, a model-agnostic subset selection framework that decouples the subset selection from model training while enabling superior model convergence and performance by using an easy-to-hard curriculum. Our empirical results indicate that MILO can train models 3 × −10× faster and tune hyperparameters 20 × −75× faster than full-dataset training or tuning without compromising performance.",
    "introduction": "Deep learning has achieved remarkable success in a multitude of machine learning tasks, including natural language processing, computer vision, and speech recognition in recent years. This success is partially due to the availability of massive training datasets and the capacity to train large-scale neural networks. However, training deep models on extensive datasets is computationally demanding, incurring significant financial costs and generating substantial CO2 emissions [63, 59 ]. Bhavya et al. [ 2] overview several research trajectories aimed at enhancing model convergence and reducing training time and costs, including data subset selection, curriculum learning, model architecture improvements, and optimization algorithm enhancements. Our work specifically focuses on selecting useful, generalizable data subsets for efficient deep neural network training. Recent research [66 , 5 , 21 ] suggests that many current training datasets are redundant, indicating that a non-redundant, informative subset could achieve comparable performance to training on the full dataset. To identify such informative samples, metrics such as prediction uncertainty [ 7], prediction flips [ 66 , 72 ], loss [42 ], or gradient/gradient-norm [ 21, 47 , 28, 27 , 29 ] have been applied. These metrics, calculated using either the downstream machine learning model or a lightweight surrogate [ 7], require a fully converged model, a requirement that runs counter to the goal of efficient training. To address this, existing subset selection algorithms [ 47 , 28 , 27, 29, 30 , 54 ] for efficient learning utilize the downstream model during training for heuristic computation and periodically update the subset as the model-dependent metrics for each sample evolve. Drawbacks of Model-Dependent Subset Selection: Despite the theoretical advantages of existing subset selection strategies[ 28 , 27, 47 ], they often fall short in computational efficiency compared to adaptive random subset selection, which selects random subsets periodically. This is primarily because traditional approaches rely on downstream models and typically require the calculation of sample metrics, such as gradients, before each subset selection step. Furthermore, these computationally demanding subset selection steps occur during model training. For instance, Figure 1 compares the convergence rate of the ResNet18 model on the CIFAR100 dataset, in terms of both time and epochs. Here, the model uses 10% subsets chosen every epoch by GradMatchPB [ 27 ], a state-of-the-art data subset selection strategy for efficient training, CraigPB [ 47 ], and Adaptive-Random (where a new 10% subset is randomly selected periodically). The selection of a new subset every epoch is done to demonstrate the maximum performance attainable by GradMatchPB and CraigPB. The results indicate that GradMatchPB achieves faster epoch convergence than both Adaptive-Random and CraigPB when selecting a new subset each epoch. However, due to the necessity for a computationally intensive subset selection step every epoch, both GradMatchPB and CraigPB demonstrate considerable inefficiency in terms of training time. In their respective studies, Killamsetty et al. [27 ] and Mirzasoleiman et al. [47] suggested selecting a new subset every R epochs to enhance training efficiency. However, this comes at the cost of the model’s convergence rate. Lastly, model-dependent subset selection requires a computationally intensive subset selection steps each time a new model is trained. Model-Agnostic Selection: Our primary insight is that a model-agnostic subset selection framework can circumvent the computationally intensive subset selection steps during model training by conducting subset selection in the preprocessing phase. By pre-selecting subsets and storing them as metadata with each dataset, we can train numerous models without incurring additional costs, effectively spreading out the expense of subset selection. In this work, we endeavor to answer the following question: Is it possible to develop a model-agnostic subset selection method that selects new subsets in a minimal amount of time, yet achieves superior model convergence without significant compromise in test accuracy or generalization performance? 1.1 Contributions MILO Framework: In this study, we introduce MILO, a model-agnostic subset selection framework designed for efficient model training and tuning. MILO employs submodular measures [ 13 , 23 ], which capture higher-order interactions between data samples for subset selection. We utilize pre-trained large language models [ 55 ] and pre-trained vision transformers [25 ] as feature encoders due to their zero-shot feature encoding capabilities. These encoders compute the sample metrics in a nominal amount of time, and this computation is independent of the downstream model, rendering MILO model-agnostic. Figure 3 provides a visual representation of MILO for model training, comprising two steps: a) A pre-processing step that involves the selection of multiple subsets from the training dataset using "Stochastic-Greedy Exploration (SGE)" (refer to Section 3.1.1), and the construction of a probability distribution over the entire dataset for subset sampling through "Weighted Random Exploration (WRE)" (refer to Section 3.1.2); b) A model training scheme that involves training the model on a curriculum of easy-to-hard subsets (refer to Section 3.1.3) using the subsets selected and the probability distribution constructed in the pre-processing step. We also present a class-wise partitioning trick to significantly minimize the memory footprint of MILO (refer to Section 3.2). Effectiveness of MILO : Through extensive experiments on multiple real-world datasets, we empirically demonstrate the effectiveness of the MILO framework for efficient training and hyperparameter tuning. In Figure 2, we provide a summary of the speedup achieved by MILO compared to full 2(a) Efficient Training (b) Efficient Tuning Figure 2: This figure illustrates the MILO’s tradeoff between speedup and accuracy degradation compared to full data training and tuning. For model training, speedups of 3× to 10× were achieved with less than a 1.5% accuracy drop, and for hyper-parameter tuning, MILO achieves speedups of 20× to 75× with less than a 0.15% accuracy drop. data training and tuning, along with the corresponding relative performance. Our results show that MILO can train models 3x to 10x faster and tune hyperparameters 20x to 75x faster, with minimal loss in performance. Furthermore, we consistently outperform the subset selection baselines that were considered. Additionally, MILO exhibits significantly faster initial model convergence and maintains faster convergence throughout training compared to other baselines. These qualities make it highly effective for applications such as hyperparameter tuning and neural architecture search, where the ability to distinguish good models from bad models early in the tuning process is crucial for enhancing efficiency [38, 37]. Related Work: In recent years, data-subset selection strategies have achieved success in various machine learning applications such as speech recognition [ 68 , 67], machine translation [ 32 ], active learning [ 60 , 1 , 33 ], hyper-parameter tuning [ 30 ], continual learning [65 ], domain adaptation [20 ], and computer vision [22]. A recent empirical study [5] demonstrated that datasets frequently contain semantic redundancies. These redundancies can be removed during training without affecting performance. In response, data pruning methods [66 , 51, 62] have developed principled selection criteria for pruning redundant samples before model training, with minimal loss in performance. However, both existing data pruning and compute-efficient learning approaches are model-dependent, resulting in them being computationally expensive. In contrast, our method is model-agnostic and capable of identifying high-quality subsets by intelligent data exploration. Furthermore, our approach can achieve superior model convergence by utilizing an easy-to-hard curriculum, transitioning from representative to diverse subsets during training.",
    "arxiv_key": "2301_13287"
}